/** 登录或注册时的协议内容 */
const Protocol = () => (
    <div style={{ userSelect: 'none' }}>
        <br />
        <p style={{ textAlign: 'center' }}>
            本项目仅供学习交流，严禁用于商业用途，若下载了本项目的开源代码，无论全部还是部分，请于24小时内删除，否则后果自负！
        </p>
        <br />
        <p>为维护本社交平台的健康生态秩序，保障良好的用户体验，根据现行法律法规制定《社交平台行为规范》：</p>
        <ul>
            <li>1、严禁进行反党反政府或带有侮辱诋毁党和国家的行为。</li>
            <li>2、严禁违反国家法律法规的内容。</li>
            <li>3、严禁宣扬暴力以及赌博内容。</li>
            <li>4、严禁以任何形式传播淫秽、色情内容。</li>
            <li>5、严禁以任何形式宣传广告类信息。</li>
        </ul>
        <br />
        <p>举报途径：联系开发者邮箱。 开发者收到举报后会在第一时间进行核实处理。欢迎玩家踊跃举报，维护美好家园！</p>
        <br />
        该管理条例自发布日起生效，最终解释权归本网站所有，本网站有权对本条例修改并公示。
        <p style={{ textAlign: 'end' }}>2023年08月29日</p>
    </div>
)

export default Protocol
